

<details>
<summary>Paleohack terraform plan</summary>

<pre>
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/hackathon-2i2c-project-alpha/locations/us-central1-b/clusters/alpha-cluster"
      ~ min_master_version          = "1.18.16-gke.300" -> "1.19.9-gke.1400"
        name                        = "alpha-cluster"
        # (26 unchanged attributes hidden)














        # (16 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["core-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/hackathon-2i2c-project-alpha/locations/us-central1-b/clusters/alpha-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/hackathon-2i2c-project-alpha/zones/us-central1-b/instanceGroupManagers/gke-alpha-cluster-core-pool-ecdba407-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "core-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "core"
              + "k8s.dask.org/node-purpose"    = "core"
                # (4 unchanged elements hidden)
            }
            tags              = [
                "gke-alpha-cluster",
                "gke-alpha-cluster-core-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["dask-worker-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/hackathon-2i2c-project-alpha/locations/us-central1-b/clusters/alpha-cluster/nodePools/dask-worker-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/hackathon-2i2c-project-alpha/zones/us-central1-b/instanceGroupManagers/gke-alpha-cluster-dask-worker-pool-ac48e52c-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "dask-worker-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 0 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "k8s.dask.org/node-purpose" = "worker"
                # (3 unchanged elements hidden)
            }
            tags              = [
                "gke-alpha-cluster",
                "gke-alpha-cluster-dask-worker-pool",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.pools["user-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "projects/hackathon-2i2c-project-alpha/locations/us-central1-b/clusters/alpha-cluster/nodePools/user-pool" -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/hackathon-2i2c-project-alpha/zones/us-central1-b/instanceGroupManagers/gke-alpha-cluster-user-pool-8bb70fd9-grp",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "user-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 0 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation           = (known after apply)
      ~ version             = "1.17.12-gke.2502" -> "1.19.9-gke.1400"
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ labels            = { # forces replacement
              + "hub.jupyter.org/node-purpose" = "user"
              + "k8s.dask.org/node-purpose"    = "scheduler"
                # (3 unchanged elements hidden)
            }
            tags              = [
                "gke-alpha-cluster",
                "gke-alpha-cluster-user-pool",
            ]
            # (11 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

</pre>
</details>